text_dict = {'admin_text': '📊 <b>Статистика бота</b>\n\n👥 <b>Пользователей в боте</b>\n     ├ <i>За все время:</i> <code>{}</code>\n     ├ <i>За месяц:</i>        <code>{}</code>\n     └ <i>За день:</i>           <code>{}</code>\n\n🏫 <b>Количество школ:</b> <code>{}</code>',
             'teacher_text': '',
             'student_text': "<b>🏫 Школа:</b> <code>Парад</code>\n<b>💼 Группа:</b> <code>2B</code>\n\n<b>🏆 Посещаемость:</b> <code>90</code>%\n<b>🎁 Баланс:</b> <code>12.0</code> Dance Coin'ов",
             'mailing_cancel': '<code>ℹ️ Рассылка отменена</code>',
             'hide_msg': '✅ Сообщение скрыто',
             'mailing_type': '<b>📍 Выберите тип рассылки</b>',
             'button_link': '<b>📌 Отправьте ссылку и название кнопки в формате:</b>\n\nссылка|ℹ️ название',
             'wait_msg': '<b>📌 Отправьте или перешлите сообщение:</b>',
             'format_error': '<b>⚠️ Ошибка формата</b>',
             'format_error_replay': '<b>⚠️ Ошибка формата, повторите ввод:</b>',
             'mailing_with_btn': '<b>✅ Рассылка с кнопкой</b>\n\n<b>💬 Текст кнопки:</b> <code>{}</code>\n<b>🔗 Ссылка:</b> {}\n\n<b>📌 Отправьте или перешлите сообщение:</b>',
             'mailing_progress': '<b>Прогресс рассылки:</b> <code>0</code>/<code>{}</code>',
             'full_mailing_progress': '<b>Прогресс рассылки:</b> <code>{}</code>/<code>{}</code>\n\n✅ Успешно: <code>{}</code>\n❌ Неуспешно: <code>{}</code>',
             'add_school_text': '<b>📌 Введите название школы:</b>',
             'add_school_complete': '✅ Школа <b>«{}»</b> успешно добавлена',
             'del_school_text': '<b>📌 Введите id школы для удаления:</b>',
             'school_not_exist': '<b>⚠️ Школы с таким номером нет в боте</b>',
             'school_del_compl': '✅ Школа <b>«{}»</b> успешно удалена',
             'faq_text': '<b>🎉 Добро пожаловать в бот от команды Xim-Trap</b>\n\n<i>🌟 Наш бот реализован для помощи в развитии танцевальных школ.\nМы реализовали для вас удобную систему рейтингов учеников, обучение теории по танцам, а так же удобную площадку для информировании о важных новостях и предстоящих соревнованиях.</i>'
             }






















